import Vue from "vue";
import Vuex from "vuex";

Vue.use(Vuex);

export default new Vuex.Store({
  state: {
    userInfo:{},
    name:"这是名字",
    account:[{"text":"全选","value":""},{"text":"云集仓-良品铺子(6105351003)","value":"6105351003"},{"text":"杭州贝创电子商务有限公司(4324931111)","value":"4324931111"},{"text":"海韵红酒(2003176097)","value":"2003176097"},{"text":"海韵电子商务（上海）有限公司(2003176098)","value":"2003176098"},{"text":"韵镖侠(2003176099)","value":"2003176099"},{"text":"上海寅焱丰有限公司(2003176100)","value":"2003176100"},{"text":"上海源芬贸易有限公司(2003176101)","value":"2003176101"},{"text":"杭州绽帛服饰有限公司(2003176102)","value":"2003176102"},{"text":"孩子梦邯郸文化传媒有限公司(2003176103)","value":"2003176103"},{"text":"韵达商业事业部UDI(2003176104)","value":"2003176104"},{"text":"Xfun吃喝杂货店(2003176105)","value":"2003176105"},{"text":"资生堂（中国）投资有限公司(2003176106)","value":"2003176106"},{"text":"资生堂（中国）投资有限公司(2003176107)","value":"2003176107"},{"text":"资生堂国际(2003176108)","value":"2003176108"},{"text":"资生堂国际(2003176109)","value":"2003176109"},{"text":"北京三快在线科技有限公司(2003176110)","value":"2003176110"},{"text":"导入账户(1122)","value":"1122"}],
    Logistics:[{"text":"韵达快递","value":"yd"},{"text":"中通快递","value":"zt"},{"text":"申通快递","value":"st"},{"text":"圆通快递","value":"yt"},{"text":"顺丰","value":"sf"},{"text":"EMS","value":"ems"},{"text":"天天快递","value":"tt"}]
  },
  mutations: {},
  actions: {},
  modules: {}
});
